#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
//整型数组，数组的下标是从0开始的
int main(){
	int arr2[] = { 1, 2, 3, 4, 5, 6, 7, 9 };/*可以不去写数组的长度，此数组的长度是依据后面的的
											数字长度来确定的，但是若打印输出时越界，则所打印的数字
											此时便是随机的了*/

	int arr[7] = { 1, 2, 3, 4, 5 };//当确认数组长度后，若数组并未放满，则数组剩余默认值为0

	int arr1[3];//默认值是随机值，并不是0,输出值为-858993460，-858993460，- 858993460

	for (int i = 0; i <= 11; i++)
	{
		printf("%d,", arr2[i]);/*此时数组arrr2[0]-arr[7]打印的是1，2，3，4，5，6，7，8，9
		                          而从arr[8] - arr[11]则是随机生成的了，分别为-858993460，19922248，7481961，1*/
	}
	printf("\n");

	for (int i = 0; i <= 6; i++)
	{
		printf("%d,", arr[i]);//输出数组arr[7]
	}
	printf("\n");
	for (int i = 0; i <= 2; i++)
	{
		printf("%d,", arr1[i]);//输出数组arr1[3]
	}
	return 0;
}